Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ལ་བཙུན་པ་མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་ལ་ཡང་བསྟེན་པར་བགྱི་བ་དང་། བསྟེན་པར་བགྱི་བ་མ་ལགས་པ་རྣམ་པ་གཉིས་མཆིས་ཞེས་ཁྱོད་གསུང་སྟེ།
en: “Regarding those, Lord, you have said, ‘There are two types of forms that are perceived by the eyes—those that are trustworthy and those that are not trustworthy.’

source: དེ་མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་རྣམས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་མ་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་དག་ནི། མངོན་དུ་ངེས་པར་སྤང་བ་ལགས་སོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘The forms perceived by the eyes that are recognized as unsuitable to adopt and adhere to are absolutely and surely to be abandoned.’

source: དེ་ལ་མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་རྣམས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་དག་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have also said, ‘Given that the Tathāgata knows the right time to teach what should be adopted at any occasion, phenomena known by the mind that are suitable to adopt and adhere to should be adopted by the mindful and vigilantly introspective.’

source: ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: The same applies to the others, up to the mental phenomena perceived by the mind.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་དེ་བཞིན་དུ་བདག་གིས་རྟོགས་ལགས་ཏེ།
en: “This is the meaning of the Tathāgata’s response, as I understand it.

source: མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། མི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་རྣམས་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘If one trusts some form perceived by the eyes and nonvirtues multiply and virtues diminish, one should no longer trust such forms perceived by the eyes.’

source: མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་མིག་གིས་ཤེས་པར་བགྱི་བའི་གཟུགས་རྣམས་ནི་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have also said, ‘If one trusts some form perceived by the eyes and nonvirtues diminish and virtues multiply, one should then trust such forms perceived by the eyes.’

source: དེ་བཞིན་དུ་རྣ་བས་ཤེས་པར་བགྱི་བའི་སྒྲ་རྣམས་དང་། སྣས་ཤེས་པར་བགྱི་བའི་དྲི་རྣམས་དང་། ལྕེས་ཤེས་པར་བགྱི་བའི་རོ་རྣམས་དང་། ལུས་ཀྱིས་ཤེས་པར་བགྱི་བའི་རེག་བྱ་རྣམས་དང་། ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་རྣམས་ཅི་ལྟ་བུ་དག་བསྟེན་ནམི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དེ་ལྟ་བུ་ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་རྣམས་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: Likewise you said, ‘If one trusts a certain sound perceived by the ears, a smell perceived by the nose, a taste perceived by the tongue, a tangible object perceived by the body, or a mental phenomenon perceived by the mind and nonvirtues multiply and virtues diminish, then one should no longer trust such mental phenomena perceived by the mind, nor, likewise, by the others.’

source: ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཡིད་ཀྱིས་ཤེས་པར་བགྱི་བའི་ཆོས་རྣམས་ནི་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་སྟེ
en: You have also said, ‘If one trusts a certain mental phenomenon perceived by the mind and nonvirtues diminish and virtues multiply, then one should trust such phenomena perceived by the mind.’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལས་ཞུ་བ་ལུང་བསྟན་པ་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཕྱི་མ་ཞུས་པ།
en: After Śakra, King of the Gods heard the Blessed One’s response to his questions, he praised the Blessed One’s words, rejoiced, and asked the Blessed One other questions.

source: བཙུན་པ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་ཆོས་དུ་ཞིག་ནི་སྤང་བར་བགྱི། ཆོས་དུ་ལ་ནི་བརྩོན་པར་བགྱི།
en: “Lord, what are the things that the ordained who have entered the path that stops discursive elaboration should abandon? What are the things in which those who have gone forth who have entered the path that stops discursive elaboration should exert themselves?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་ཆོས་གསུམ་ནི་སྤང་བར་བྱའོ། །ཆོས་གསུམ་ལ་ནི་བརྩོན་པར་བྱའོ། །
en: “Kauśika,” the Blessed One replied, “there are three things that the ordained who have entered the path that stops discursive elaboration should abandon, and three things in which they should exert themselves.

source: འདི་ལྟ་སྟེ་གང་གིས་རྟོག་པར་དཔྱོད་པའོ། །
en: They concern how one speaks, thinks, and analyzes.

source: ཀཽ་ཤི་ཀ་ཚིག་ལ་ཡང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་རོ། །
en: As I have said, Kauśika, ‘There are two types of speech—trustworthy and untrustworthy.’

source: དེ་ལ་ཚིག་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི། མངོན་དུ་ངེས་པར་སྤང་བར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have said, ‘Utterances that are recognized as unsuitable to adopt and adhere to are absolutely and surely to be abandoned.’

source: དེ་ལ་ཚིག་བསྒྲུབས་ཏེ་གནས་པར་བྱ་བའི་འོས་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་བསྒྲུབ་པར་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted on any occasion, utterances that are recognized as suitable to adopt and adhere to are to be adopted by the mindful and vigilantly introspective.’

source: ཀཽ་ཤི་ཀ་རྟོག་པ་ལ་ཡང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་རོ། །
en: “As I have said, Kauśika, ‘There are also two types of thought construction— trustworthy and untrustworthy.

source: དེ་ལ་དཔྱོད་པ་བསྒྲུབས་ཏེ་གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི། མངོན་དུ་ངེས་པར་སྤང་བར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have said, ‘Thought constructions and analyses that are unsuitable to be adopted and adhered to are absolutely and surely to be abandoned.’

source: དེ་ལ་དཔྱོད་པ་བསྒྲུབས་ཏེ་གནས་པར་བྱ་བའི་འོས་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said, ‘Given that the Tathāgata knows the right time to teach what should be adopted on any occasion, analyses suitable to adopt and adhere to should be adopted by the mindful and vigilantly introspective.’ ”

source: སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས། ཆོས་གསུམ་ནི་སྤང་བར་བགྱི། ཆོས་གསུམ་ལ་ནི་བརྩོན་པར་བགྱི་སྟེ།
en: “There are three things that the ordained who have entered the path that stops discursive elaboration should abandon, and three things in which they should exert themselves.

source: འདི་ལྟ་སྟེ་གང་གིས་ཚིག་དང་རྟོག་པ་དང་དཔྱོད་པའོ། །
en: They concern how one speaks, thinks, and analyzes.

source: བཙུན་པ་ཚིག་ཀྱང་བསྟེན་པར་བགྱི་བ་དང་། བསྟེན་པར་བགྱི་བ་མ་ལགས་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: Lord, you have said, ‘There are two types of speech—trustworthy and untrustworthy.’

source: དེ་ལ་ཚིག་བསྒྲུབས་ཏེ་གནས་པར་བགྱི་བའི་འོས་མ་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། མངོན་དུ་ངེས་པར་སྤང་བར་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘Utterances that are recognized as unsuitable to adopt and adhere to are absolutely and surely to be abandoned.’

source: དེ་ལ་ཚིག་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་བསྒྲུབ་པར་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་ངོ་། །
en: You have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted on any occasion, utterances that are recognized as suitable to adopt and adhere to are to be adopted by the mindful and vigilantly introspective.’

source: བཙུན་པ་རྟོག་པ་དཔྱོད་པ་ཡང་བསྟེན་པར་བགྱི་བ་དང་། བསྟེན་པར་བགྱི་བ་མ་ལགས་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: “Lord, you have said, ‘There are also two types of thought construction and analysis—trustworthy and untrustworthy.’

source: དེ་ལ་དཔྱོད་པ་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་མ་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་དག་ནི། མངོན་དུ་ངེས་པར་སྤང་བ་ལགས་སོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘Thought constructions and analyses that are unsuitable to be adopted and adhered to should absolutely and surely be abandoned.’

source: དེ་ལ་དཔྱོད་པ་བསྒྲུབས་ཏེ་གནས་པར་བགྱི་བའི་འོས་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་དག་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: You have also said, ‘Given that the Tathāgata knows the right time to teach what should be adopted on any occasion, analyses suitable to adopt and adhere to should be adopted by the mindful and vigilantly introspective.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ཏེ།
en: “This is the meaning of the Blessed One’s response, as I understand it.

source: ཚིག་ཅི་ལྟ་བུ་དག་བསྟེན་ན། མི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཚིག་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘If one trusts some utterance and nonvirtues multiply and virtues diminish, one should no longer trust such utterances.’

source: ཚིག་ཅི་ལྟ་བུ་དེ་དག་བསྟེན་ན་མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཚིག་རྣམས་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have also said, ‘If one trusts some utterance and nonvirtues diminish and virtues multiply, one should trust such utterances.’

source: རྟོག་པ་དང་དཔྱོད་པ་ཅི་ལྟ་བུ་དག་བསྟེན་ན། དེའི་མི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྟོག་པ་དང་དཔྱོད་པ་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘If one trusts some thought construction and analysis and nonvirtues multiply and virtues diminish, one should no longer trust such thought constructions and analyses.’

source: དཔྱོད་པ་ཅི་ལྟ་བུ་དག་བསྟེན་ན་དེའི་མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྟོག་པ་དང་དཔྱོད་པ་རྣམས་ནི་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་སྟེ
en: You have said, ‘If one trusts some analysis and nonvirtues diminish and virtues multiply, one should trust such analyses.’

source: བཅོམ་ལྡན་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས། སོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ། །
en: I understand the meaning of the Blessed One’s words, have overcome my doubt, and have no hesitation.”

source: བཙུན་པ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་ལུས་རྣམ་པ་དུ་ཞིག་ན། རྣམ་པ་གཉིས་མཆིས་ཞེས་གསུང་།
en: “Lord, how many of these aspects of the bodies of the ordained who have entered the path that stops discursive elaboration have you said have two aspects themselves?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་ལུས་རྣམ་པ་གསུམ་ལ། རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་ཏེ།
en: “Kauśika,” The Blessed One replied, “I have said, ‘There are three aspects of the bodies of the ordained who have entered the path that stops discursive elaboration, each of two different types.’

source: ཡིད་བདེ་བའི་ལུས་དང་ཡིད་མི་བདེ་བའི་ལུས་དང་བཏང་སྙོམས་ཀྱི་ལུས་སོ། །
en: These are the pleasant body, the unpleasant body, and the neutral body.

source: ཀཽ་ཤི་ཀ་དེའི་ཡིད་བདེ་བའི་ལུས་ཀྱང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ་རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་རོ། །
en: Kauśika, I have said, ‘There are also two types of pleasant body—trustworthy and untrustworthy.’

source: དེ་ལ་ཡིད་བདེ་བའི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་མངོན་དུ་ངེས་པར་སྤང་བར་བྱ་བ་ཡིན་ནོ་ཞེས་ང་ཟེར་རོ། །
en: I have said, ‘The pleasant body that is recognized as unsuitable to adopt and adhere to is absolutely and surely to be abandoned.’

source: དེ་ལ་ཡིད་བདེ་བའི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བྱ་བའི་འོས་ཡིན་པར་ཤེས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted on any occasion, the pleasant body that is recognized as suitable to adopt and adhere to is to be adopted by the mindful and vigilantly introspective.’

source: ཀཽ་ཤི་ཀ་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ཀྱང་བསྟེན་པར་བྱ་བ་དང་། བསྟེན་པར་བྱ་བ་མ་ཡིན་པ། རྣམ་པ་གཉིས་ཡོད་དོ་ཞེས་ང་ཟེར་རོ། །
en: “Kauśika, I have said, ‘There are also two types of unpleasant body and neutral body—trustworthy and untrustworthy.’

source: ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་བསྒྲུབས་ཏེ་གནས་པར་བྱ་བའི་འོས་མ་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་མངོན་དུ་ངེས་པར་སྤང་བར་བྱ་བ་ཡིན་ནོ་ཞེས་ང་ཟེར་རོ། །
en: “I have said, ‘The unpleasant body and the neutral body that are recognized as unsuitable to adopt and adhere to are absolutely and surely to be abandoned.’

source: དེ་ལ་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་བསྒྲུབས་ཏེ་གནས་པར་བྱ་བའི་འོས་ཡིན་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ང་ཟེར་རོ། །
en: I have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted at any occasion, the unpleasant body and the neutral body recognized as suitable to adopt and adhere to are to be adopted by the mindful and vigilantly introspective.’ ”

source: སྤྲོས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལ་ཞུགས་པའི་དགེ་སློང་གིས་ལུས་རྣམ་པ་གསུམ་ལ། རྣམ་པ་གཉིས་མཆིས་སོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: “Lord, you said, ‘There are three aspects of the bodies of the ordained who have entered the path that stops discursive elaboration, each of two different types.

source: ཡིད་བདེ་བའི་ལུས་དང་། ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་སོ། །
en: These are the pleasant body, the unpleasant body, and the neutral body.’

source: བཙུན་པ་ཡིད་བདེ་བའི་ལུས་ཀྱང་བསྟེན་པར་བགྱི་བ་དང་། བསྟེན་པར་བགྱི་བ་མ་ལགས་པ་རྣམ་པ་གཉིས་མཆིས་སོ་ཞེས་ཁྱོད་གསུང་སྟེདེ་ལ་ཡིད་བདེ་བའི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་མ་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། མངོན་དུ་ངེས་པར་སྤང་བ་ལགས་སོ་ཞེས་ཁྱོད་གསུང་།
en: Lord, you have said, ‘‘The pleasant body that is recognized as unsuitable to adopt and adhere to is absolutely and surely to be abandoned.’

source: དེ་ལ་ཡིད་བདེ་བའི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་། །
en: You have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted on any occasion, the pleasant body that is recognized as suitable to adopt and adhere to is to be adopted by the mindful and vigilantly introspective.’

source: ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ཀྱང་བསྟེན་པར་བགྱི་བ་དང་། བསྟེན་པར་བགྱི་བ་མ་ལགས་པ་རྣམ་པ་གཉིས་མཆིས་སོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: “You have said, ‘There are also two types of unpleasant body and neutral body—trustworthy and untrustworthy.’

source: དེ་ལ་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་མ་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། མངོན་དུ་ངེས་པར་སྤང་བར་བགྱི་བ་ལགས་སོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘The unpleasant body and neutral body that are recognized as unsuitable to adopt and adhere to are absolutely and surely to be abandoned.’

source: དེ་ལ་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་བསྒྲུབས་ཏེ། གནས་པར་བགྱི་བའི་འོས་ལགས་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི། དེའི་སྐབས་སུ་དེ་བཞིན་གཤེགས་པས་དེ་ལུང་བསྟན་པའི་དུས་མཁྱེན་ནས། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པས་བསྒྲུབ་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་སྟེ།
en: You have also said, ‘Given that the Tathāgata knows the time to teach what should be adopted on any occasion, the unpleasant body and neutral body recognized as suitable to adopt and adhere to are to be adopted by the mindful and vigilantly introspective.’

source: ཡིད་བདེ་བའི་ལུས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། དེ་མི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཡིད་བདེ་བའི་ལུས་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘If one trusts some pleasant body and nonvirtues multiply and virtues diminish, one should no longer trust such a pleasant body.’

source: ཡིད་བདེ་བའི་ལུས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། དེ་མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཡིད་བདེ་བའི་ལས་ནི་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have also said, ‘If one trusts some pleasant body and nonvirtues diminish and virtues multiply, one should trust such a pleasant body.’

source: ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། དེའི་མི་དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ། དེ་ལྟ་བུའི་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ནི་བསྟེན་པར་མི་བྱའོ་ཞེས་ཁྱོད་གསུང་།
en: You have said, ‘If one trusts some unpleasant body or neutral body and nonvirtues multiply and virtues diminish, one should no longer trust such an unpleasant body or neutral body.’

source: ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ཅི་ལྟ་བུ་དག་བསྟེན་ན། དེས་མི་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཡིད་མི་བདེ་བའི་ལུས་དང་། བཏང་སྙོམས་ཀྱི་ལུས་ནི་བསྟེན་པར་བྱའོ་ཞེས་ཁྱོད་གསུང་སྟེ
en: You have also said, ‘If one trusts some unpleasant body or neutral body and nonvirtues diminish and virtues multiply, one should trust such an unpleasant body or neutral body.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ནས། སོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ལགས་སོ།། །།
en: I understand the meaning of the Blessed One’s words, have overcome my doubt, and have no hesitation.”

source: བཙུན་པ་སེམས་ཅན་ཐམས་ཅད་འདོད་པ་གཅིག་པ་དང་། འདུན་པ་གཅིག་པ་དང་། དད་པ་གཅིག་པ་དང་། བསམ་པ་གཅིག་པ་ལགས་སམ།
en: “Lord, are all beings alike in their desires, cravings, beliefs, and intentions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སེམས་ཅན་ཐམས་ཅད་ནི་འདོད་པ་གཅིག་པ་དང་། འདུན་པ་གཅིག་པ་དང་། དད་པ་གཅིག་པ་དང་། བསམ་པ་གཅིག་པ་མ་ཡིན་ནོ། །
en: “No, Kauśika,” the Blessed One replied, “all beings are not alike in their desires, cravings, beliefs, and intentions.

source: ཀཽ་ཤི་ཀ་འཇིག་རྟེན་འདི་དག་ནི་ཁམས་ཐ་དད་པ་ཡིན་གྱི། ཁམས་གཅིག་པ་མ་ཡིན་ཏེ།
en: Kauśika, beings do not have a single temperament; they have various temperaments.

source: དེ་དག་ནི་ཁམས་གང་དང་གང་འཛིན་པ་དེ་དང་དེ་ནན་གྱིས་མཆོག་ཏུ་འཛིན་ཅིང་། མངོན་པར་ཞེན་ནས་རྗེས་སུ་སྤྱོད་པར་བྱེད་དེ།
en: Those who insist that a certain temperament is supreme are utterly convinced of it and act accordingly, thinking,

source: འདི་ནི་བདེན་གྱི་གཞན་ནི་གཏི་མུག་པའོ་སྙམ་དུ་སེམས་སོ། །
en: ‘This is the truth. Others are deluded.’

source: ཀཽ་ཤི་ཀ་གལ་ཏེ་འཇིག་རྟེན་འདི་དག་ཁམས་ཐ་དད་པ་དང་། ཁམས་དུ་མ་པ་ཡིན་དུ་ཟིན་ན་ནི། སེམས་ཅན་འདི་དག་ཁམས་གང་དང་གང་འཛིན་པ་དེ་དང་དེ་ནན་གྱིས་མཆོག་ཏུ་འཛིན་ཅིང་། མངོན་པར་ཞེན་ནསརྗེས་སུ་སྤྱོད་པར་བྱེད་དེ།
en: “Kauśika, since it is the case that beings have various different temperaments, then those who insist that a certain temperament is supreme, are utterly convinced of it, and act accordingly should not think, ‘

source: འདི་ནི་བདེན་གྱི་གཞན་ནི་གཏི་མུག་པའོ་སྙམ་དུ་མི་སེམས་པ་ཞིག་ན་གང་གི་ཕྱིར་འཇིག་རྟེན་འདི་དག་ཁམས་ཐ་དད་པ་དང་། ཁམས་དུ་མ་པ་ཡིན་ཏེ། དེའི་ཕྱིར་སེམས་ཅན་འདི་དག་ཁམས་གང་དང་གང་འཛིན་པ་དེ་དང་དེ་ནན་གྱིས་མཆོག་ཏུ་འཛིན་ཅིང་མངོན་པར་ཞེན་ནས། རྗེས་སུ་སྤྱོད་པར་བྱེད་དོ། །
en: This is the truth. Others are deluded.’ This is because it is on account of beings having various different temperaments that they insist that a certain temperament is supreme, are utterly convinced of it, and act accordingly, thinking,

source: སེམས་ཅན་ཐམས་ཅད་ནི་འདོད་པ་གཅིག་པ་དང་། འདུན་པ་གཅིག་པ་དང་། དད་པ་གཅིག་པ་དང་། བསམ་པ་གཅིག་པ་མ་ལགས་ཏེ།
en: “All beings are not alike in their desires, cravings, beliefs, and intentions.

source: བཙུན་པ་འཇིག་རྟེན་འདི་དག་ནི་ཁམས་ཐ་དད་པ་དང་། ཁམས་དུ་མ་པ་ལགས་ཏེ།
en: Lord, beings have various different temperaments.

source: དེ་དག་ཁམས་གང་དང་གང་འཛིན་པ་དེ་དང་དེ་ནན་གྱིས་མཆོག་ཏུ་འཛིན་ཅིང་མངོན་པར་ཞེན་ནས། རྗེས་སུ་སྤྱོད་པར་བགྱིད་དོ། །
en: On this account, they insist that a certain temperament is supreme, are utterly convinced of it, and act accordingly, thinking,

source: འདི་ནི་བདེན་གྱི་གཞན་ནི་གཏི་མུག་པའོ་སྙམ་དུ་སེམས་ལགས་སོ། །
en: ‘This is the truth. Others are deluded.’

source: བཙུན་པ་ཅི་ལགས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཐམས་ཅད་གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་།
en: “Lord, tell me—have the ascetics and brahmins all attained the unsurpassed, supreme welfare?

source: གཏན་དུ་དྲི་མ་དང་བྲལ་བ་དང་། གཏན་དུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཕྱིན་པ་ལགས་སམ།
en: Are they all forever free of distorting influences and perfected in their practice of pure conduct?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཐམས་ཅད་གཡུང་དྲུང་གི་མཐར་ཐུག་པ་དང་།
en: “Kauśika,” the Blessed One replied, “the ascetics and brahmins have not all attained the unsurpassed, supreme welfare,

source: གཏན་དུ་དྲི་མ་དང་བྲལ་བ་དང་། གཏན་དུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཕྱིན་པ་མ་ཡིན་གྱིས།
en: nor are they all forever free of distorting influences and perfected in their practice of pure conduct.

source: དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་སུ་ཡང་རུང་སྟེབླ་ན་མེད་པའི་རྣམ་པར་གྲོལ་བ་ལ་སྲིད་པ་ཡང་དག་པར་ཟད་ཅིང་། ཡང་དག་པར་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བར་གྱུར་པ་དེ་དག་ནི་གཡུང་དྲུང་གི་མཐར་ཐུག་པ་དང་། གཏན་དུ་དྲི་མ་དང་བྲལ་བ་དང་། གཏན་དུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཕྱིན་པ་ཡིན་ནོ། །
en: Only those among the ascetics and brahmins who have exhausted their thirst for unexcelled liberation and whose perfect minds are utterly liberated have attained the unsurpassed, supreme welfare, and are forever free of distorting influences and perfected in their practice of pure conduct.”

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ཐམས་ཅད་གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། གཏན་དུ་དྲི་མ་དང་བྲལ་བ་དང་། གཏན་དུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཐུག་པ་མ་ལགས་ཏེ།
en: “The ascetics and brahmins have not all attained the unsurpassed, supreme welfare, nor are they all forever free of distorting influences and perfected in their practice of pure conduct.

source: དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་གང་ཡང་རུང་སྟེ། བླ་ན་མེད་པའི་རྣམ་པར་གྲོལ་བར་གྱུར་པ་ལས། སྲིད་པ་ཡང་དག་པར་ཟད་ཅིང་།
en: Only those among the ascetics and brahmins who have exhausted their thirst for unexcelled liberation and

source: ཡང་དག་པར་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་དེ་དག་ནི། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་དང་། གཏན་དུ་དྲི་མ་དང་བྲལ་བ་དང་། གཏན་དུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཕྱིན་པ་ལགས་སོ། །
en: whose perfect minds are utterly liberated have attained the unsurpassed, supreme welfare, and are forever free of distorting influences and perfected in their practice of pure conduct.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་འདི་བདག་གིས་རྟོགས་ཤིང་། ཆོས་བདག་གིས་རྟོགས་ནསསོམ་ཉི་ལས་བརྒལ་ཏེ། ཐེ་ཙོམ་དང་བྲལ་ཞིང་ཟུག་རྔུ་ཕྱུང་ནས། ཡོངས་སུ་ཡི་ཆད་པ་མ་མཆིས་པའི་སླད་དུ།
en: I understand the meaning of the Blessed One’s words, have overcome my doubt, have no hesitation, and with this thorn removed, I no longer despair.

source: བདག་གིས་བདག་གང་ལགས་སྙམ་དུ་བདག་གི་ཡིད་ལ་ཕྱིར་སྐྱེ་བར་མི་འགྱུར་ལགས་སོ། །
en: On this account I shall henceforth never give rise to such thoughts again.

source: བཙུན་པ་ཞུ་བ་ལུང་བསྟན་པ་ཁྱད་པར་རྟོགས་པ་གང་དག་བདག་གིས་མ་ཐོབ་པ་ལས། ད་ནི་བདག་གིས་ཡུན་རིང་པོ་ཞིག་ལགས་ན། བཅོམ་ལྡན་འདས་ལ་བརྟེན་ཏེ།
en: “Lord, because of not having gained any understanding before in specific response to my questions, after a long time waiting, I have now finally consulted the Blessed One.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བཀའ་སྩལ་ནས། སོམ་ཉི་དང་ཡིད་གཉིས་ཀྱི་ཟུག་རྔུ་རྩ་བ་ནས་བཏོན་ལགས་སོ། །
en: By means of the words spoken by the Tathāgata, the Arhat, the totally and completely awakened Buddha, the thorn of my doubt and second thoughts has been removed.”

source: ཀཽ་ཤི་ཀ་སྔོན་ཅད་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་གཞན་དག་ལ་ཡང་དྲི་བ་འདི་ལྟ་བུ་དྲིས་པ་དྲན་ནམ།
en: “Kauśika, do you recall asking such questions of the other ascetics and brahmins?”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཙུན་པ་གློ་བ་ལ་དྲན་པ་ལགས་ཏེ།
en: Śakra, King of the Gods, replied, “Yes, Lord, I do recall this.

source: དུས་གཅིག་ཅིག་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་ལྷ་རྣམས་འདུས་ཤིང་འཁོད་པར་གྱུར་ཏེ།
en: At one time the gods gathered and took their seats in the assembly hall of the Heaven of the Thirty-Three.
